Revision of all pandas concept learned

In [1]:
import pandas as pd

In [2]:
# Create your own data frame
students = {
    'id' : [1,2,3,4,5,6],
    'first' : ['Rabin', 'Sabin', 'Prabin', 'Harbin', 'Damin', 'Ramin'],
    'last' : ['Karki', 'Sarki', 'Tharki', 'Darki', 'Narki', 'Parki'],
    'email': ['rabinkarki11@gmail.com', 'sabinsarki234@gmail.com', 'tharkiprabin345@gmail.com', 
                'darkiharbin456@gmail.com', 'narkidamin789@gmail.com', 'raminparki348@gmail.com'],
    'GPA' : [3.44, 3.89, 2.90, 4.00, 3.19, 4.00]
}
df = pd.DataFrame(students)
df

   id   first    last                      email   GPA
0   1   Rabin   Karki     rabinkarki11@gmail.com  3.44
1   2   Sabin   Sarki    sabinsarki234@gmail.com  3.89
2   3  Prabin  Tharki  tharkiprabin345@gmail.com  2.90
3   4  Harbin   Darki   darkiharbin456@gmail.com  4.00
4   5   Damin   Narki    narkidamin789@gmail.com  3.19
5   6   Ramin   Parki    raminparki348@gmail.com  4.00

In [3]:
df.columns

Index(['id', 'first', 'last', 'email', 'GPA'], dtype='object')

In [4]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [5]:
df.head()

   id   first    last                      email   GPA
0   1   Rabin   Karki     rabinkarki11@gmail.com  3.44
1   2   Sabin   Sarki    sabinsarki234@gmail.com  3.89
2   3  Prabin  Tharki  tharkiprabin345@gmail.com  2.90
3   4  Harbin   Darki   darkiharbin456@gmail.com  4.00
4   5   Damin   Narki    narkidamin789@gmail.com  3.19

In [6]:
df.tail()

   id   first    last                      email   GPA
1   2   Sabin   Sarki    sabinsarki234@gmail.com  3.89
2   3  Prabin  Tharki  tharkiprabin345@gmail.com  2.90
3   4  Harbin   Darki   darkiharbin456@gmail.com  4.00
4   5   Damin   Narki    narkidamin789@gmail.com  3.19
5   6   Ramin   Parki    raminparki348@gmail.com  4.00

In [7]:
df.shape # size of the dataframe

(6, 5)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      6 non-null      int64
 1   first   6 non-null      object
 2   last    6 non-null      object
 3   email   6 non-null      object
 4   GPA     6 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 368.0+ bytes

In [9]:
df.describe()

             id       GPA
count  6.000000  6.000000
mean   3.500000  3.570000
std    1.870829  0.465274
min    1.000000  2.900000
25%    2.250000  3.252500
50%    3.500000  3.665000
75%    4.750000  3.972500
max    6.000000  4.000000

Lesson two revision

In [10]:
df['first'] # Accessing a column

0     Rabin
1     Sabin
2    Prabin
3    Harbin
4     Damin
5     Ramin
Name: first, dtype: object

In [11]:
df.email

0       rabinkarki11@gmail.com
1      sabinsarki234@gmail.com
2    tharkiprabin345@gmail.com
3     darkiharbin456@gmail.com
4      narkidamin789@gmail.com
5      raminparki348@gmail.com
Name: email, dtype: object

In [12]:
df[['last', 'first']]

     last   first
0   Karki   Rabin
1   Sarki   Sabin
2  Tharki  Prabin
3   Darki  Harbin
4   Narki   Damin
5   Parki   Ramin

In [13]:
type(df[['last', 'first']])

pandas.core.frame.DataFrame

In [14]:
df.columns

Index(['id', 'first', 'last', 'email', 'GPA'], dtype='object')

In [15]:
df.iloc[0] # first row

id                            1
first                     Rabin
last                      Karki
email    rabinkarki11@gmail.com
GPA                        3.44
Name: 0, dtype: object

In [16]:
# multiple rows
df.iloc[[0,1]]

   id  first   last                    email   GPA
0   1  Rabin  Karki   rabinkarki11@gmail.com  3.44
1   2  Sabin  Sarki  sabinsarki234@gmail.com  3.89

In [17]:
df.iloc[[0,3], [0,2,3]] # iloc[[rows], [cols]]

   id   last                     email
0   1  Karki    rabinkarki11@gmail.com
3   4  Darki  darkiharbin456@gmail.com

In [18]:
# Slicing
df.iloc[0:2, 0:2]

   id  first
0   1  Rabin
1   2  Sabin

Lesson three revision

In [19]:
# The day is all about indexes
df.set_index('id', inplace=True)
df

     first    last                      email   GPA
id
1    Rabin   Karki     rabinkarki11@gmail.com  3.44
2    Sabin   Sarki    sabinsarki234@gmail.com  3.89
3   Prabin  Tharki  tharkiprabin345@gmail.com  2.90
4   Harbin   Darki   darkiharbin456@gmail.com  4.00
5    Damin   Narki    narkidamin789@gmail.com  3.19
6    Ramin   Parki    raminparki348@gmail.com  4.00

In [20]:
df.loc[1:5:2]

     first    last                      email   GPA
id
1    Rabin   Karki     rabinkarki11@gmail.com  3.44
3   Prabin  Tharki  tharkiprabin345@gmail.com  2.90
5    Damin   Narki    narkidamin789@gmail.com  3.19

In [21]:
df.loc[1:3]

     first    last                      email   GPA
id
1    Rabin   Karki     rabinkarki11@gmail.com  3.44
2    Sabin   Sarki    sabinsarki234@gmail.com  3.89
3   Prabin  Tharki  tharkiprabin345@gmail.com  2.90

In [22]:
df.loc[::-1]

     first    last                      email   GPA
id
6    Ramin   Parki    raminparki348@gmail.com  4.00
5    Damin   Narki    narkidamin789@gmail.com  3.19
4   Harbin   Darki   darkiharbin456@gmail.com  4.00
3   Prabin  Tharki  tharkiprabin345@gmail.com  2.90
2    Sabin   Sarki    sabinsarki234@gmail.com  3.89
1    Rabin   Karki     rabinkarki11@gmail.com  3.44

In [23]:
df.index

Int64Index([1, 2, 3, 4, 5, 6], dtype='int64', name='id')

In [24]:
df.iloc[0:2, 0:2] # slicing with iloc

    first   last
id
1   Rabin  Karki
2   Sabin  Sarki

In [25]:
# To reset index
df.reset_index() # inplace to make it premanent

   id   first    last                      email   GPA
0   1   Rabin   Karki     rabinkarki11@gmail.com  3.44
1   2   Sabin   Sarki    sabinsarki234@gmail.com  3.89
2   3  Prabin  Tharki  tharkiprabin345@gmail.com  2.90
3   4  Harbin   Darki   darkiharbin456@gmail.com  4.00
4   5   Damin   Narki    narkidamin789@gmail.com  3.19
5   6   Ramin   Parki    raminparki348@gmail.com  4.00

Revision of Data Filtering

In [ ]:
gpaFilt = (df['GPA'] < 4.0) # series with bool values, it corresponds with DF
df[gpaFilt] # a filter mask on the dataframe

     first    last                      email   GPA
id
1    Rabin   Karki     rabinkarki11@gmail.com  3.44
2    Sabin   Sarki    sabinsarki234@gmail.com  3.89
3   Prabin  Tharki  tharkiprabin345@gmail.com  2.90
5    Damin   Narki    narkidamin789@gmail.com  3.19

In [28]:
df.loc[gpaFilt]

     first    last                      email   GPA
id
1    Rabin   Karki     rabinkarki11@gmail.com  3.44
2    Sabin   Sarki    sabinsarki234@gmail.com  3.89
3   Prabin  Tharki  tharkiprabin345@gmail.com  2.90
5    Damin   Narki    narkidamin789@gmail.com  3.19

In [ ]:
df.loc[gpaFilt, ['last', 'email']] # pass the columns in the filter

      last                      email
id
1    Karki     rabinkarki11@gmail.com
2    Sarki    sabinsarki234@gmail.com
3   Tharki  tharkiprabin345@gmail.com
5    Narki    narkidamin789@gmail.com

In [34]:
# AND &
fil2 = (df['GPA'] > 2.5 ) & (df['last'] == 'Karki')
df.loc[fil2]

    first   last                   email   GPA
id
1   Rabin  Karki  rabinkarki11@gmail.com  3.44

In [35]:
# Inverting a filter
df.loc[~fil2]

     first    last                      email   GPA
id
2    Sabin   Sarki    sabinsarki234@gmail.com  3.89
3   Prabin  Tharki  tharkiprabin345@gmail.com  2.90
4   Harbin   Darki   darkiharbin456@gmail.com  4.00
5    Damin   Narki    narkidamin789@gmail.com  3.19
6    Ramin   Parki    raminparki348@gmail.com  4.00

In [36]:
# You could use a list to find permissible values in a column
# Keep the names of a column in a list
# values = [val1, val2, val3, ... , valn]
# cols = [col1, col2, col3, ..., coln]
# filt = df['Val'].isin(values)
# df.loc[filt, cols]

In [ ]:
# resolve to use co-pilot tomorrow.